docs/posts/2015-03-15-crucified-god-chapter-3.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Cross-Shattered Christ, Chapter 3</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Cross-Shattered Christ, Chapter 3</h1>
<p class="subtitle" role="doc-subtitle">Mar 15, 2015</p>
</header><p>
Kierkegaard&rsquo;s <i>Fear and Trembling</i> focuses on Abraham, an example of what Kierkegaard calls a &ldquo;Knight of Faith.&rdquo; When I asked for other examples, someone suggested Mary, the mother of Jesus. At the time, I was skeptical, because it did not seem to me that Mary had an opportunity to reject God&rsquo;s plan; the angel Mary announced that Mary would conceive, and never asked Mary if she wanted to cooperate in this endeavor.
</p>

<p>
My mistake, as if often the case, is to think of Mary only as the young girl in the Christmas story, and neglect the woman that reared a child whom she surely could never keep — anguish foreshadowed by Simeon&rsquo;s remark by Simeon&rsquo;s cryptic remark to Mary, &ldquo;A sword will pierce your own soul too.&rdquo; Mary, though, despite her anguish, has hope, as we must also. As Hauerwas states:
</p>

<p>
So may we never forget that we, the church, comprise Mary’s home. A home, moreover, that promises not safety but rather the ongoing challenge of being a people called from the nations to be God’s people. A people constituted by faith in the One who refused to triumph through the violence the world believes to be the only means possible to achieve some limited good, to insure we will be remembered. The refusal to use violence in the name of the good does not mean this people can forget those singled out in Mary’s song of triumph— that is, the poor and powerless. Rather, it means that such a people, Mary-like, must live by hope— a hope that patiently waits with Mary at the foot of her son’s cross.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
</p>


<div class="tagline" id="org6b48a11">
<p>
Tagged: <a href="../tags/religion.html">Religion</a>
</p>

</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes</h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Hauerwas, Stanley (2005-01-01). <i>Cross-Shattered Christ: Meditations on the Seven Last Words</i> (pp. 41-45). Baker Publishing Group. Kindle Edition. 
</p></div></div>


</div>
</div></main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
